outputs/qwen36-35b-a3b-fp8_pro5000_8x72g_input-4k-output-1k_cand32_baseline/results/c015/bench_c50_20260831-015801.log
$ python -m sglang.bench_serving --backend sglang --dataset-name random-ids --random-range-ratio 1.0 --host 127.0.0.1 --port 30000 --model /data/autotune/models/Qwen3.6-35B-A3B-FP8 --dataset-path '' --max-concurrency 50 --random-input-len 4096 --random-output-len 1024 --output-file /workspace/outputs/c015/bench_c50_20260831-015801.jsonl --num-prompts 200
# exit code: 0

----- stdout -----
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=50, output_file='/workspace/outputs/c015/bench_c50_20260831-015801.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/data/autotune/models/Qwen3.6-35B-A3B-FP8', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=50, output_file='/workspace/outputs/c015/bench_c50_20260831-015801.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 819200
#Output tokens: 204800
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 50        
Successful requests:                     200       
Benchmark duration (s):                  74.32     
Total input tokens:                      819200    
Total input text tokens:                 819200    
Total generated tokens:                  204800    
Total generated tokens (retokenized):    202013    
Request throughput (req/s):              2.69      
Input token throughput (tok/s):          11022.07  
Output token throughput (tok/s):         2755.52   
Peak output token throughput (tok/s):    4641.00   
Peak concurrent requests:                63        
Total token throughput (tok/s):          13777.59  
Concurrency:                             47.60     
Accept length:                           3.59      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   17687.49  
Median E2E Latency (ms):                 16590.63  
P90 E2E Latency (ms):                    23342.18  
P95 E2E Latency (ms):                    24707.63  
P99 E2E Latency (ms):                    31722.83  
---------------Time to First Token----------------
Mean TTFT (ms):                          2053.08   
Median TTFT (ms):                        1017.11   
P90 TTFT (ms):                           4907.17   
P95 TTFT (ms):                           5754.53   
P99 TTFT (ms):                           16256.64  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.28     
Median TPOT (ms):                        14.89     
P90 TPOT (ms):                           20.37     
P95 TPOT (ms):                           21.78     
P99 TPOT (ms):                           23.79     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           15.44     
Median ITL (ms):                         9.74      
P90 ITL (ms):                            29.37     
P95 ITL (ms):                            42.46     
P99 ITL (ms):                            79.35     
Max ITL (ms):                            5255.51   
==================================================

----- stderr -----
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(

  0%|          | 0/200 [00:00<?, ?it/s]
  0%|          | 1/200 [00:15<52:01, 15.68s/it]
  3%|▎         | 6/200 [00:15<06:23,  1.98s/it]
  7%|▋         | 14/200 [00:16<02:12,  1.41it/s]
 10%|▉         | 19/200 [00:17<01:35,  1.89it/s]
 10%|█         | 21/200 [00:18<01:28,  2.02it/s]
 12%|█▏        | 24/200 [00:18<01:08,  2.58it/s]
 14%|█▎        | 27/200 [00:19<00:56,  3.08it/s]
 14%|█▍        | 29/200 [00:19<00:52,  3.25it/s]
 15%|█▌        | 30/200 [00:20<01:05,  2.59it/s]
 16%|█▌        | 31/200 [00:20<01:04,  2.61it/s]
 16%|█▌        | 32/200 [00:21<00:58,  2.87it/s]
 16%|█▋        | 33/200 [00:21<00:57,  2.90it/s]
 17%|█▋        | 34/200 [00:21<00:58,  2.85it/s]
 18%|█▊        | 35/200 [00:22<00:58,  2.83it/s]
 18%|█▊        | 37/200 [00:22<00:40,  4.03it/s]
 19%|█▉        | 38/200 [00:22<00:51,  3.18it/s]
 20%|█▉        | 39/200 [00:23<00:49,  3.22it/s]
 22%|██▏       | 43/200 [00:23<00:36,  4.26it/s]
 23%|██▎       | 46/200 [00:24<00:38,  4.01it/s]
 24%|██▎       | 47/200 [00:24<00:37,  4.12it/s]
 24%|██▍       | 48/200 [00:31<03:38,  1.43s/it]
 26%|██▌       | 51/200 [00:32<02:04,  1.19it/s]
 26%|██▌       | 52/200 [00:32<01:51,  1.33it/s]
 28%|██▊       | 57/200 [00:33<01:03,  2.26it/s]
 30%|██▉       | 59/200 [00:33<00:54,  2.58it/s]
 30%|███       | 61/200 [00:34<00:45,  3.07it/s]
 32%|███▏      | 63/200 [00:34<00:46,  2.92it/s]
 32%|███▏      | 64/200 [00:35<00:45,  3.00it/s]
 34%|███▎      | 67/200 [00:35<00:33,  3.94it/s]
 34%|███▍      | 68/200 [00:35<00:34,  3.85it/s]
 34%|███▍      | 69/200 [00:36<00:40,  3.21it/s]
 36%|███▌      | 71/200 [00:36<00:37,  3.44it/s]
 36%|███▌      | 72/200 [00:37<00:39,  3.27it/s]
 38%|███▊      | 75/200 [00:37<00:31,  3.92it/s]
 38%|███▊      | 76/200 [00:38<00:32,  3.81it/s]
 38%|███▊      | 77/200 [00:38<00:31,  3.86it/s]
 40%|████      | 80/200 [00:38<00:28,  4.28it/s]
 41%|████      | 82/200 [00:39<00:22,  5.21it/s]
 42%|████▏     | 83/200 [00:39<00:23,  4.91it/s]
 42%|████▏     | 84/200 [00:39<00:23,  4.86it/s]
 42%|████▎     | 85/200 [00:40<00:32,  3.49it/s]
 43%|████▎     | 86/200 [00:40<00:31,  3.58it/s]
 44%|████▍     | 88/200 [00:40<00:29,  3.75it/s]
 45%|████▌     | 90/200 [00:41<00:26,  4.19it/s]
 46%|████▌     | 91/200 [00:41<00:27,  4.03it/s]
 46%|████▌     | 92/200 [00:42<00:34,  3.14it/s]
 46%|████▋     | 93/200 [00:42<00:32,  3.33it/s]
 47%|████▋     | 94/200 [00:42<00:33,  3.15it/s]
 48%|████▊     | 95/200 [00:43<00:53,  1.96it/s]
 48%|████▊     | 96/200 [00:48<02:49,  1.63s/it]
 48%|████▊     | 97/200 [00:48<02:05,  1.22s/it]
 49%|████▉     | 98/200 [00:48<01:35,  1.06it/s]
 50%|█████     | 100/200 [00:49<00:59,  1.68it/s]
 50%|█████     | 101/200 [00:49<00:53,  1.84it/s]
 51%|█████     | 102/200 [00:49<00:47,  2.05it/s]
 52%|█████▏    | 103/200 [00:50<00:47,  2.06it/s]
 52%|█████▏    | 104/200 [00:50<00:44,  2.14it/s]
 52%|█████▎    | 105/200 [00:50<00:38,  2.47it/s]
 53%|█████▎    | 106/200 [00:51<00:37,  2.47it/s]
 54%|█████▍    | 108/200 [00:51<00:29,  3.09it/s]
 55%|█████▍    | 109/200 [00:52<00:26,  3.41it/s]
 55%|█████▌    | 110/200 [00:52<00:28,  3.19it/s]
 56%|█████▌    | 111/200 [00:52<00:25,  3.50it/s]
 56%|█████▌    | 112/200 [00:52<00:22,  3.96it/s]
 56%|█████▋    | 113/200 [00:52<00:20,  4.32it/s]
 57%|█████▋    | 114/200 [00:53<00:20,  4.14it/s]
 57%|█████▊    | 115/200 [00:53<00:20,  4.12it/s]
 58%|█████▊    | 116/200 [00:53<00:21,  3.91it/s]
 58%|█████▊    | 117/200 [00:53<00:19,  4.18it/s]
 59%|█████▉    | 118/200 [00:54<00:19,  4.31it/s]
 60%|██████    | 120/200 [00:54<00:13,  5.76it/s]
 61%|██████    | 122/200 [00:54<00:15,  5.08it/s]
 62%|██████▏   | 123/200 [00:55<00:21,  3.56it/s]
 62%|██████▏   | 124/200 [00:55<00:20,  3.79it/s]
 62%|██████▎   | 125/200 [00:55<00:19,  3.82it/s]
 63%|██████▎   | 126/200 [00:56<00:18,  4.03it/s]
 64%|██████▎   | 127/200 [00:56<00:21,  3.42it/s]
 64%|██████▍   | 128/200 [00:56<00:21,  3.32it/s]
 64%|██████▍   | 129/200 [00:57<00:21,  3.25it/s]
 65%|██████▌   | 130/200 [00:57<00:21,  3.33it/s]
 66%|██████▌   | 131/200 [00:57<00:20,  3.38it/s]
 66%|██████▌   | 132/200 [00:57<00:19,  3.56it/s]
 66%|██████▋   | 133/200 [00:58<00:22,  2.94it/s]
 67%|██████▋   | 134/200 [00:58<00:20,  3.17it/s]
 68%|██████▊   | 136/200 [00:59<00:20,  3.13it/s]
 70%|███████   | 140/200 [01:00<00:15,  3.93it/s]
 70%|███████   | 141/200 [01:01<00:22,  2.65it/s]
 71%|███████   | 142/200 [01:01<00:19,  2.92it/s]
 72%|███████▏  | 143/200 [01:01<00:20,  2.74it/s]
 72%|███████▏  | 144/200 [01:04<00:57,  1.03s/it]
 73%|███████▎  | 146/200 [01:06<00:46,  1.15it/s]
 74%|███████▎  | 147/200 [01:06<00:38,  1.39it/s]
 74%|███████▍  | 148/200 [01:06<00:34,  1.53it/s]
 75%|███████▌  | 150/200 [01:07<00:27,  1.80it/s]
 76%|███████▌  | 151/200 [01:07<00:23,  2.10it/s]
 76%|███████▌  | 152/200 [01:08<00:20,  2.36it/s]
 76%|███████▋  | 153/200 [01:08<00:17,  2.71it/s]
 78%|███████▊  | 155/200 [01:08<00:11,  4.04it/s]
 78%|███████▊  | 157/200 [01:08<00:09,  4.74it/s]
 80%|███████▉  | 159/200 [01:09<00:06,  6.14it/s]
 80%|████████  | 160/200 [01:09<00:06,  5.72it/s]
 82%|████████▏ | 163/200 [01:09<00:04,  7.90it/s]
 84%|████████▎ | 167/200 [01:09<00:02, 11.42it/s]
 85%|████████▌ | 170/200 [01:09<00:02, 13.29it/s]
 86%|████████▌ | 172/200 [01:10<00:03,  8.87it/s]
 87%|████████▋ | 174/200 [01:10<00:02,  8.91it/s]
 88%|████████▊ | 177/200 [01:10<00:02, 11.04it/s]
 90%|████████▉ | 179/200 [01:10<00:01, 11.51it/s]
 91%|█████████ | 182/200 [01:11<00:01, 10.31it/s]
 92%|█████████▎| 185/200 [01:11<00:01, 11.71it/s]
 94%|█████████▎| 187/200 [01:11<00:01,  8.38it/s]
 94%|█████████▍| 189/200 [01:12<00:01,  6.25it/s]
 95%|█████████▌| 190/200 [01:13<00:02,  3.74it/s]
 96%|█████████▌| 191/200 [01:13<00:02,  3.50it/s]
 96%|█████████▌| 192/200 [01:13<00:02,  3.88it/s]
 97%|█████████▋| 194/200 [01:13<00:01,  5.49it/s]
 98%|█████████▊| 195/200 [01:13<00:00,  5.53it/s]
 99%|█████████▉| 198/200 [01:14<00:00,  8.33it/s]
100%|██████████| 200/200 [01:14<00:00,  8.67it/s]
100%|██████████| 200/200 [01:14<00:00,  2.69it/s]